src/upload/RequestRegistrarPagoIFX_WS1via.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:RegistrarPagoIFX>
			<tem:infoPago>
			<![CDATA[<?xml version="1.0" encoding="UTF-8"?><IFX>
	<SignonRq>
		<ClientDt>2030-10-23T14:20:06</ClientDt>
		<CustLangPref>es-CO</CustLangPref>
		<ClientApp>
			<Org>Bancolombia</Org>
			<Name>RINSV</Name>
			<Version>1.0</Version>
		</ClientApp>
	</SignonRq>
	<PaySvcRq>
		<RqUID>00000000-0000-0000-0000-917000404500</RqUID>
		<MsgRqHdr>
			<NetworkTrnInfo>
				<NetworkOwner>02</NetworkOwner>
				<BankId>0007</BankId>
			</NetworkTrnInfo>
			<PointOfServiceData>
				<Environment/>
				<POSAgent>
					<AgentId></AgentId>
				</POSAgent>
				<POSLocation>917</POSLocation>
			</PointOfServiceData>
		</MsgRqHdr>
		<SPName>0000</SPName>
		<PmtAddRq>
			<RqUID>00000000-0000-0000-0000-917000404500</RqUID>
			<PmtInfo>
				<CurAmt>
					<Amt>100.00</Amt>
					<CurCode>E</CurCode>
				</CurAmt>
				<RemitInfo>
					<CustPayeeId>0</CustPayeeId>
					<BillId>00000000-0000-0000-0500-124000404500</BillId>
					<BillRefInfo></BillRefInfo>
					<PmtId>Identificador del Grupo</PmtId>
					<CurAmt>
						<Amt>100.00</Amt>
					</CurAmt>
				</RemitInfo>
				<DepAcctIdFrom>
					<AcctId/>
					<AcctType>Default</AcctType>
					<BankInfo/>
				</DepAcctIdFrom>
				<PrcDt>2030-10-23</PrcDt>
			</PmtInfo>
		</PmtAddRq>
	</PaySvcRq>
</IFX>]]></tem:infoPago>
		</tem:RegistrarPagoIFX>
	</soapenv:Body>
</soapenv:Envelope>